Update claims-enterprise-azure.md
